sim/analysis/amr/10xbase/ngP_01_02_1_3_3/250_40_1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme		Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
	default         Gauss linear;
}

divSchemes
{
    	default         none;
		div(tauMC)		Gauss linear;
		div(phi,O2)		Gauss vanLeer01;
		div(phi,H2)		Gauss vanLeer01;
		div(phi,H2O)	Gauss vanLeer01;
		div(phi,N2)		Gauss vanLeer01;
		div(phi,Yi_h)	Gauss vanLeer;
}

laplacianSchemes
{
		default			Gauss linear uncorrected;	
}

interpolationSchemes
{
    	default				linear;
		reconstruct(rho)	Minmod;
		reconstruct(U)		MinmodV;
		reconstruct(T)		Minmod;
		reconstruct(Yi)		Minmod;
}

snGradSchemes
{
		default				uncorrected;
}


// ************************************************************************* //
